const express = require('express')
var router = express.Router();
const axios = require('axios');
__path = process.cwd()
const fs = require('fs');

router.get('/', async(req, res) => {
	var d = new Date();
    const hrs = d.getHours().toString().padStart(2, 0);
	const gn_text = ["😘𝙂𝙤𝙤𝙙 🙈𝙣𝙞𝙜𝙝𝙩 💫✨","🤗𝓖𝓸𝓸𝓭 🧚‍♀𝓷𝓲𝓰𝓱𝓽 ❄️✨","🌌❡០០ᖱ 🌙⩎ɨ❡ϦƬ 🌎","😘ցօօժ ⭐️ղíցհԵ 💝","🌃Ꮐᝪᝪᗞ 🙈ᑎᏆᏀᕼᎢ 💫✨","꧁༒♛ good nιgнт ♛༒꧂","𝓰𝓸𝓸𝓭 𝓷𝓲𝓰𝓱𝓽💕","ğôõd○ňîğht♧◇♤♡", "¥${☆.ĞØĐĎ ÑÎĢHŤ.☆}$¥", "꧁✞ঔৣ۝☬  ☬۝ঔৣ🅶🅾🅾🅳🅽🅸🅶🅷🆃", "❤️* *ǤØØĐ ŇƗǤĦŦ* *❤️💕🥰", "•𝓝𝓲𝓰𝓱𝓽☾", "꧁༺ ***** *ǤØØĐ ŇƗǤĦŦ*  ***** ༻", "❀◕ ‿ ◕❀₲ØØĐ ℕ𝕀𝔾𝕙𝕋❀◕ ‿ ◕❀", "🍃ᴳᴼᴼᴰ🍁ɴɪɢʜᴛ🥀", "GᴏᴏᴅNɪɢʜᴛ ☾", "꧁꧁✞ঔৣ۝☬  ☬۝ঔৣ🅶🅾🅾🅳🅽🅸🅶🅷", "●●●●●●♤♡ğøøđ ňīğhț♤♡●●●●●●●》》", "~*⏥____♡|•गुᴅ͢• • 🇳𝐈𝐆𝐇𝐓⃠•", "Good▄︻̷̿┻̿═━一night", "❤️ 𝔾𝕠𝕠𝕕 ℕ𝕚𝕘𝕙𝕥 ❤️", "♥●❥╚»♛«╝ 𝙣𝙞𝙜𝙝𝙩 ╚»♛«╝●❥♥", "•.,¸¸,.•¯💖 *Ǥ𝕠όᵈ 𝓝𝔦ⒼнŦ*", "ทۖ เ🅖█▬█ 𝔱", "✨𝔾𝕠𝕠𝕕 ℕ𝕚𝕘𝕙𝕥 ☽⋆✨", "GOoDnIgHt😗💛", "G⚫⚫D...NI:GHT", "♡✨ǤØØĐ ŇƗǤĦŦ✨♡", "♡ĞØØĐ ŇĪĞHȚ♡", "||____G⭕⭕d Night____||", "♡▪G•O•O•D~N•I•G•H•T▪♡", "●⃝ᶫᵒꪜe☯ᴳᶹʳᶹ᭄●⁴³", "❤️* *ǤØØĐ ŇƗǤĦŦ* *",  "•°•°•°GOOD NIGHT°•°•°•", "❤️good night✨⚡", "ᴳᴼᴼᴰ|ɴɪɢʜᴛ⋆", "Night ❤️💕🥰", "🍃ᴳᴼᴼᴰ🍁ɴɪɢʜᴛ", "Good Night 😴😴", "°~||...♪♪G∅∅D Π¡gH†♪♪...||~°", "Good night 😴🥱", "👻 Good Night 👻"];
    const gm_text = ["❀🍃Good❀ ❀morning❀🥰❀","☘️𝐺𝑜𝑜𝑑 🌅𝑚𝑜𝑟𝑛𝑖𝑛𝑔 💐","🍃𝙶𝚘𝚘𝚍 🌻𝚖𝚘𝚛𝚗𝚒𝚗𝚐 🥰","🍀𝗚𝗼𝗼𝗱 😘𝗺𝗼𝗿𝗻𝗶𝗻𝗴 🌸","🌻𝓖𝓸𝓸𝓭 𝓶𝓸𝓻𝓷𝓲𝓷𝓰 💞","🌼🅖🅞🅞🅓 🅜🅞🅡🅝🅘🅝🅖 🐶","🍃Ⓖⓞⓞⓓ 🌈ⓜⓞⓡⓝⓘⓝⓖ 🥰","≋G≋o≋o≋d≋ ≋M≋o≋r≋n≋i≋n≋g≋", "◦•●❤♡ GððÐ Mðrñïñg ♡❤●•◦", "G♥o♥o♥d♥ ♥M♥o♥r♥n♥i♥n♥g", "(◍•ᴗ•◍) ミ💖 ꜍G꜉꜍o꜉꜍o꜉꜍d꜉ ꜍M꜉꜍o꜉꜍r꜉꜍n꜉꜍i꜉꜍n꜉꜍g꜉ 💖彡", "( ﾟ∀ﾟ)ﾉ【G̷o̷o̷d̷ ̷M̷o̷r̷n̷i̷n̷g̷】", "◦•●◉✿ Ｇｏｏｄ Ｍｏｒｎｉｎｇ ✿◉●•◦", "『G』『o』『o』『d』 『M』『o』『r』『n』『i』『n』『g』", "♥ 🌅 𝐆𝔬𝓸𝕕 𝐦σＲŇ𝓘η𝑔 🌤️ 🐣ൠ", "░G░o░o░d░ ░M░o░r░n░i░n░g░", "【G】【o】【o】【d】 【M】【o】【r】【n】【i】【n】【g】", "ıllıllı⭐🌟 G͙o͙o͙d͙ M͙o͙r͙n͙i͙n͙g͙ 🌟⭐ıllıllı", "෴❤️෴ G҉o҉o҉d҉ ҉M҉o҉r҉n҉i҉n҉g҉ ෴❤️෴", "💖´ •.¸♥¸.•* G͛⦚o͛⦚o͛⦚d͛⦚ M͛⦚o͛⦚r͛⦚n͛⦚i͛⦚n͛⦚g͛⦚ *•.¸♥¸.•´💖", "˜”°•.˜”°• Good Morning •°”˜.•°”˜", "[̲̅G][̲̅o][̲̅o][̲̅d] [̲̅M][̲̅o][̲̅r][̲̅n][̲̅i][̲̅n][̲̅g]", "█▓▒­░⡷⠂GФФD MФЯИIИG⠐⢾░▒▓█", "G⃣ o⃣ o⃣ d⃣ M⃣ o⃣ r⃣ n⃣ i⃣ n⃣ g⃣", "(༒G●●d M●RNINg༒)", "꧁༺ɢօօɖ ʍօʀռɨռɢ༻꧂", "꧁ɢȏȏԀ༒ṃȏяṅıṅɢ࿐", "꧁༒☬Good Morning ☬༒꧂", "⚡GØoͥdmͣoͫrήiήg⚡", "꧁ঔৣ☬✞good mornin☠︎☬✞☬ঔৣ꧂▄︻┻═┳一", "★🅶🅾🅾🅳 🅼🅾🆁🅽🅸🅽🅶★", "🄶🄾🄾🄳∞︎︎♡🄼🄾🅁🄽🄸🄽🄶", "꧁༒☬🄶🄾🄾🄳∞︎︎(☉🄼🄾🅁🄽🄸 ☬༒꧂", "꧁🅶🅾🅾🅳♡🅼🅾🆁🅽🅸🅽🅶꧂", "⚡꧁ɢȏȏԀ༒ṃȏяṅıṅɢ࿐,⚡","❣️ Ｇｏｏｄ Ｍｏｒｎｉｎｇ ❣️", "🌹 ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ 🌹", "🌅 𝔾𝕠𝕠𝕕 𝕄𝕠𝕣𝕟𝕚𝕟𝕘 🌤️", "🌄 𝒢𝑜𝑜𝒹 𝑀𝑜𝓇𝓃𝒾𝓃𝑔 🌟", "🌅 ₲ØØĐ ₥ØⱤ₦ł₦₲ 🌻", "💕 GӨӨD MӨЯПIПG 💕", "🌅 𝙶𝚘𝚘𝚍 𝙼𝚘𝚛𝚗𝚒𝚗𝚐 🌤️", "🌅 𝓖𝓸𝓸𝓭 𝓜𝓸𝓻𝓷𝓲𝓷𝓰 🌤️", "🌄Ⓖⓞⓞⓓ Ⓜⓞⓡⓝⓘⓝⓖ🌻", "🥰 gσσ∂ мσяηιηg 🌅", "💐 GððÐ Mðrñïñg 💐", "🌹 Good Morning 🌹", "🌹 Gₒₒd ₘₒᵣₙᵢₙg 🌹", "🌅 ᴳᵒᵒᵈ ᴹᵒʳⁿⁱⁿᵍ 🌤️", "🌅 𝔊𝔬𝔬𝔡 𝔐𝔬𝔯𝔫𝔦𝔫𝔤 🌤️", "🌺 𝕲𝖔𝖔𝖉 𝕸𝖔𝖗𝖓𝖎𝖓𝖌 🌺", "🌅 🅶🅾🅾🅳 🅼🅾🆁🅽🅸🅽🅶 🌤️", "🌅️ ɓuıuɹoW poo⅁⛅", "🌅 Ꮆㄖㄖᗪ 爪ㄖ尺几丨几Ꮆ 🌤️", "★彡[ɢᴏᴏᴅ ᴍᴏʀɴɪɴɢ]彡★", "꧁༒☬𝓖𝓸𝓸𝓭 𝓜𝓸𝓻𝓷𝓲𝓷𝓰☬༒꧂", "ǤØØĐ ΜØŘŇƗŇǤ", "ĞŐŐĎ МŐŔŃĨŃĞ", "Gσσԃ Mσɾɳιɳɠ", "Ꮆㄖㄖᗪ 爪ㄖ尺几丨几Ꮆ", "▄︻デG̲o̲o̲d̲ ̲M̲o̲r̲n̲i̲n̲g̲══━一", "g⊕⊕d m⊕rηïηg", "G̶o̶o̶d̶ ̶M̶o̶r̶n̶i̶n̶g̶", "Gѳѳд Ѫѳяпїпg", "ᘜᓍᓍᕲ ᘻᓍᖇᘉᓰᘉᘜ", "GФФD MФЯИIИG", "Gₒₒ𝚍 Mₒᵣ𝚗ᵢ𝚗g", "G̶o̶o̶d̶ ̶M̶o̶r̶n̶i̶n̶g̶", "Ɠօօժ Ɱօɾղìղց", "GOOᗪ ᗰOᖇᑎIᑎG", "ƓØØÐ ௱Ø尺ЛɪЛƓ", "G͢o͢o͢d͢ M͢o͢r͢n͢i͢n͢g͢", "G͎͍͐￫o͎͍͐￫o͎͍͐￫d͎͍͐￫ M͎͍͐￫o͎͍͐￫r͎͍͐￫n͎͍͐￫i͎͍͐￫n͎͍͐￫g͎͍͐￫", "G̴o̴o̴d̴ ̴M̴o̴r̴n̴i̴n̴g̴", "G̊⫶o̊⫶o̊⫶d̊⫶ M̊⫶o̊⫶r̊⫶n̊⫶i̊⫶n̊⫶g̊⫶", "ģόόȡ мόŕήίήģ", "⦑G⦒⦑o⦒⦑o⦒⦑d⦒ ⦑M⦒⦑o⦒⦑r⦒⦑n⦒⦑i⦒⦑n⦒⦑g⦒", "G⊶o⊶o⊶d⊶ ⊶M⊶o⊶r⊶n⊶i⊶n⊶g", "🌄 ᎶᎧᎧᎴ ᎷᎧᏒᏁᎥᏁᎶ 🌄", "🌅 ɢօօɖ ʍօʀռɨռɢ 🌤️", "🌹 ɠơơɖ ɱơཞŋıŋɠ 🌹", "🌄G̳o̳o̳d̳ ̳M̳o̳r̳n̳i̳n̳g̳❣️", "🌺 𝐆𝐨𝐨𝐝 𝐌𝐨𝐫𝐧𝐢𝐧𝐠🌺", "💐 𝘎𝘰𝘰𝘥 𝘔𝘰𝘳𝘯𝘪𝘯𝘨 💐", "【﻿Ｇｏｏｄ　Ｍｏｒｎｉｎｇ】", "🌅 𝙂𝙤𝙤𝙙 𝙈𝙤𝙧𝙣𝙞𝙣𝙜 🌤️", "🌅 𝗚𝗼𝗼𝗱 𝗠𝗼𝗿𝗻𝗶𝗻𝗴 🌅", "⧼G̼⧽⧼o̼⧽⧼o̼⧽⧼d̼⧽ ⧼M̼⧽⧼o̼⧽⧼r̼⧽⧼n̼⧽⧼i̼⧽⧼n̼⧽⧼g̼⧽", "🌅G̷o̷o̷d̷ ̷M̷o̷r̷n̷i̷n̷g̷🌄", "🌅 ງ໐໐໓ ๓໐rຖiຖງ 🌤️", "❣️G̲o̲o̲d̲ ̲M̲o̲r̲n̲i̲n̲g̲❣️", "🌹G҉o҉o҉d҉ ҉M҉o҉r҉n҉i҉n҉g҉ 🌹", "🌟Ｇｏｏｄ　ＭｏｒｎｉｎG 🌟", "ƓƠƠƊ MƠƦƝƖƝƓ", "🌺G̾o̾o̾d̾ ̾M̾o̾r̾n̾i̾n̾g̾🌺", "🌹G͎o͎o͎d͎ ͎M͎o͎r͎n͎i͎n͎g͎🌻", "🌹 𝑮𝒐𝒐𝒅 𝑴𝒐𝒓𝒏𝒊𝒏𝒈 😘", "🌅 ムののり ﾶの尺刀ﾉ刀ム 🌤️", "💕G͓̽o͓̽o͓̽d͓̽ ͓̽M͓̽o͓̽r͓̽n͓̽i͓̽n͓̽g͓̽💕", "GððÐ Mðrñïñg", "っ◔◡◔)っ ♥ Good Morning ♥"];
	const gf_text = ["ɢᴏᴏᴅ ᴀғᴛᴇʀɴᴏᴏɴ 🌞","𝓖𝓸𝓸𝓭 𝓐𝓯𝓽𝓮𝓻𝓷𝓸𝓸𝓷", "𝔾𝕠𝕠𝕕 𝔸𝕗𝕥𝕖𝕣𝕟𝕠𝕠𝕟", "Ⓖⓞⓞⓓ Ⓐⓕⓣⓔⓡⓝⓞⓞⓝ", "🅖🅞🅞🅓 🅐🅕🅣🅔🅡🅝🅞🅞🅝", "🄶🄾🄾🄳 🄰🄵🅃🄴🅁🄽🄾🄾🄽", "🅶🅾🅾🅳 🅰🅵🆃🅴🆁🅽🅾🅾🅽", "GOOᗪ ᗩᖴTEᖇᑎOOᑎ", "𝔊𝔬𝔬𝔡 𝔄𝔣𝔱𝔢𝔯𝔫𝔬𝔬𝔫", "ɢᴏᴏᴅ ᴀꜰᴛᴇʀɴᴏᴏɴ", "⅁oop ∀ɟʇǝɹυooυ", "G⃣o⃣o⃣d⃣ A⃣f⃣t⃣e⃣r⃣n⃣o⃣o⃣n⃣", "ﻮ๏๏๔ คŦՇєгภ๏๏ภ", "Gσσԃ Aϝƚҽɾɳσσɳ", "𝐆𝐨𝐨𝐝 𝐀𝐟𝐭𝐞𝐫𝐧𝐨𝐨𝐧", "𝙂𝙤𝙤𝙙 𝘼𝙛𝙩𝙚𝙧𝙣𝙤𝙤𝙣", "𝑮𝒐𝒐𝒅 𝑨𝒇𝒕𝒆𝒓𝒏𝒐𝒐𝒏", "𝙶𝚘𝚘𝚍 𝙰𝚏𝚝𝚎𝚛𝚗𝚘𝚘𝚗", "₲ØØĐ ₳₣₮ɆⱤ₦ØØ₦", "Ꮆㄖㄖᗪ 卂千ㄒ乇尺几ㄖㄖ几", "【G】【o】【o】【d】 【A】【f】【t】【e】【r】【n】【o】【o】【n】", "『G』『o』『o』『d』 『A』『f』『t』『e』『r』『n』『o』『o』『n』", "≋G≋≋o≋≋o≋≋d≋ ≋A≋≋f≋≋t≋≋e≋≋r≋≋n≋≋o≋≋o≋≋n≋", "[̲̅G][̲̅o][̲̅o][̲̅d] [̲̅A][̲̅f][̲̅t][̲̅e][̲̅r][̲̅n][̲̅o][̲̅o][̲̅n]", "♥G♥♥o♥♥o♥♥d♥ ♥A♥♥f♥♥t♥♥e♥♥r♥♥n♥♥o♥♥o♥♥n♥", "Ǵőőd Áftéŕńőőń", "ꁅꂦꂦꀸ ꍏꎇ꓄ꍟꋪꈤꂦꂦꈤ", "ƓƠƠƊ ƛƑƬЄƦƝƠƠƝ", "〔G〕﹝o﹞﹝o﹞﹝d﹞ 〔A〕﹝f﹞﹝t﹞﹝e﹞﹝r﹞﹝n﹞﹝o﹞﹝o﹞﹝n﹞", "🇬 🇴 🇴 🇩 🇦 🇫 🇹 🇪 🇷 🇳 🇴 🇴 🇳", "G҉o҉o҉d҉ A҉f҉t҉e҉r҉n҉o҉o҉n҉", "《G》《o》《o》《d》 《A》《f》《t》《e》《r》《n》《o》《o》《n》", "╠G╣╠o╣╠o╣╠d╣ ╠A╣╠f╣╠t╣╠e╣╠r╣╠n╣╠o╣╠o╣╠n╣", "💞G💞o💞o💞d 💞A💞f💞t💞e💞r💞n💞o💞o💞n", "💗G💗o💗o💗d 💗A💗f💗t💗e💗r💗n💗o💗o💗n", "💘G💘o💘o💘d 💘A💘f💘t💘e💘r💘n💘o💘o💘n", "💕G💕o💕o💕d 💕A💕f💕t💕e💕r💕n💕o💕o💕n", "⟅G⟆⟅o⟆⟅o⟆⟅d⟆ ⟅A⟆⟅f⟆⟅t⟆⟅e⟆⟅r⟆⟅n⟆⟅o⟆⟅o⟆⟅n⟆", "⊰G⊱⊰o⊱⊰o⊱⊰d⊱ ⊰A⊱⊰f⊱⊰t⊱⊰e⊱⊰r⊱⊰n⊱⊰o⊱⊰o⊱⊰n⊱", "⚞G⚟⚞o⚟⚞o⚟⚞d⚟ ⚞A⚟⚞f⚟⚞t⚟⚞e⚟⚞r⚟⚞n⚟⚞o⚟⚞o⚟⚞n⚟", "≼G≽≼o≽≼o≽≼d≽ ≼A≽≼f≽≼t≽≼e≽≼r≽≼n≽≼o≽≼o≽≼n≽", "⫷G⫸⫷o⫸⫷o⫸⫷d⫸ ⫷A⫸⫷f⫸⫷t⫸⫷e⫸⫷r⫸⫷n⫸⫷o⫸⫷o⫸⫷n⫸", "⋖G⋗⋖o⋗⋖o⋗⋖d⋗ ⋖A⋗⋖f⋗⋖t⋗⋖e⋗⋖r⋗⋖n⋗⋖o⋗⋖o⋗⋖n⋗", "Ｇｏｏｄ Ａｆｔｅｒｎｏｏｎ", "ꁅꂦꂦꂠ ꁲꄞꋖꈼꌅꋊꂦꂦꋊ", "ɠσσ∂ αƒƭεɾɳσσɳ", "ցօօժ αբԵҽɾղօօղ", "gοο∂ αƒτєяиοοи", "ԳԾԾԺ ԹԲԵeՐՌԾԾՌ", "ᏀϴϴᎠ ᎪҒͲᎬᎡΝϴϴΝ", "G꙲    o꙲    o꙲    d꙲     A꙲    f꙲    t꙲    e꙲    r꙲    n꙲    o꙲    o꙲    n꙲  ", " G⃫  o⃫  o⃫  d⃫   A⃫  f⃫  t⃫  e⃫  r⃫  n⃫  o⃫  o⃫  n⃫  ", "𝐺𝑜𝑜𝑑 𝐴𝑓𝑡𝑒𝑟𝑛𝑜𝑜𝑛", "𝘎𝘰𝘰𝘥 𝘈𝘧𝘵𝘦𝘳𝘯𝘰𝘰𝘯", "𝖦𝗈𝗈𝖽 𝖠𝖿𝗍𝖾𝗋𝗇𝗈𝗈𝗇", "𝗚𝗼𝗼𝗱 𝗔𝗳𝘁𝗲𝗿𝗻𝗼𝗼𝗻", "𝕲𝖔𝖔𝖉 𝕬𝖋𝖙𝖊𝖗𝖓𝖔𝖔𝖓", "𝒢ℴℴ𝒹 𝒜𝒻𝓉ℯ𝓇𝓃ℴℴ𝓃", "𝓖𝓸𝓸𝓭 𝓐𝓯𝓽𝓮𝓻𝓷𝓸𝓸𝓷"];
	const ge_text = ["ɢᴏᴏᴅ ᴇᴠᴇɴɪɴɢ 🌥","𝓖𝓸𝓸𝓭 𝓮𝓿𝓮𝓷𝓲𝓷𝓰", "𝔾𝕠𝕠𝕕 𝕖𝕧𝕖𝕟𝕚𝕟𝕘", "Ⓖⓞⓞⓓ ⓔⓥⓔⓝⓘⓝⓖ", "🅖🅞🅞🅓 🅔🅥🅔🅝🅘🅝🅖", "🄶🄾🄾🄳 🄴🅅🄴🄽🄸🄽🄶", "🅶🅾🅾🅳 🅴🆅🅴🅽🅸🅽🅶", "GOOᗪ EᐯEᑎIᑎG", "𝔊𝔬𝔬𝔡 𝔢𝔳𝔢𝔫𝔦𝔫𝔤", "ɢᴏᴏᴅ ᴇᴠᴇɴɪɴɢ", "⅁oop ǝʌǝυıυɓ", "G⃣o⃣o⃣d⃣ e⃣v⃣e⃣n⃣i⃣n⃣g⃣", "ﻮ๏๏๔ єשєภเภﻮGσσԃ ҽʋҽɳιɳɠ", "𝐆𝐨𝐨𝐝 𝐞𝐯𝐞𝐧𝐢𝐧𝐠", "𝙂𝙤𝙤𝙙 𝙚𝙫𝙚𝙣𝙞𝙣𝙜", "𝑮𝒐𝒐𝒅 𝒆𝒗𝒆𝒏𝒊𝒏𝒈", "𝙶𝚘𝚘𝚍 𝚎𝚟𝚎𝚗𝚒𝚗𝚐", "₲ØØĐ ɆVɆ₦ł₦₲", "Ꮆㄖㄖᗪ 乇ᐯ乇几丨几Ꮆ", "【G】【o】【o】【d】 【e】【v】【e】【n】【i】【n】【g】", "『G』『o』『o』『d』 『e』『v』『e』『n』『i』『n』『g』", "≋G≋≋o≋≋o≋≋d≋ ≋e≋≋v≋≋e≋≋n≋≋i≋≋n≋≋g≋", "[̲̅G][̲̅o][̲̅o][̲̅d] [̲̅e][̲̅v][̲̅e][̲̅n][̲̅i][̲̅n][̲̅g]", "♥G♥♥o♥♥o♥♥d♥ ♥e♥♥v♥♥e♥♥n♥♥i♥♥n♥♥g♥", "Ǵőőd évéńíńǵ", "ꁅꂦꂦꀸ ꍟᐯꍟꈤꀤꈤꁅ", "ƓƠƠƊ ЄƔЄƝƖƝƓ", "〔G〕﹝o﹞﹝o﹞﹝d﹞ ﹝e﹞﹝v﹞﹝e﹞﹝n﹞﹝i﹞﹝n﹞﹝g﹞", "🇬 🇴 🇴 🇩 🇪 🇻 🇪 🇳 🇮 🇳 🇬", "G҉o҉o҉d҉ e҉v҉e҉n҉i҉n҉g҉", "《G》《o》《o》《d》 《e》《v》《e》《n》《i》《n》《g》", "╠G╣╠o╣╠o╣╠d╣ ╠e╣╠v╣╠e╣╠n╣╠i╣╠n╣╠g╣", "💞G💞o💞o💞d 💞e💞v💞e💞n💞i💞n💞g", "💗G💗o💗o💗d 💗e💗v💗e💗n💗i💗n💗g", "💘G💘o💘o💘d 💘e💘v💘e💘n💘i💘n💘g", "💕G💕o💕o💕d 💕e💕v💕e💕n💕i💕n💕g", "⟅G⟆⟅o⟆⟅o⟆⟅d⟆ ⟅e⟆⟅v⟆⟅e⟆⟅n⟆⟅i⟆⟅n⟆⟅g⟆", "⊰G⊱⊰o⊱⊰o⊱⊰d⊱ ⊰e⊱⊰v⊱⊰e⊱⊰n⊱⊰i⊱⊰n⊱⊰g⊱", "⚞G⚟⚞o⚟⚞o⚟⚞d⚟ ⚞e⚟⚞v⚟⚞e⚟⚞n⚟⚞i⚟⚞n⚟⚞g⚟", "≼G≽≼o≽≼o≽≼d≽ ≼e≽≼v≽≼e≽≼n≽≼i≽≼n≽≼g≽", "⫷G⫸⫷o⫸⫷o⫸⫷d⫸ ⫷e⫸⫷v⫸⫷e⫸⫷n⫸⫷i⫸⫷n⫸⫷g⫸", "⋖G⋗⋖o⋗⋖o⋗⋖d⋗ ⋖e⋗⋖v⋗⋖e⋗⋖n⋗⋖i⋗⋖n⋗⋖g⋗", "Ｇｏｏｄ ｅｖｅｎｉｎｇ", "ꁅꂦꂦꂠ ꈼꀰꈼꋊꂑꋊꁅ", "ɠσσ∂ εѵεɳเɳɠ", "ցօօժ ҽѵҽղíղց", "gοο∂ єνєиιиg", "ԳԾԾԺ eעeՌɿՌԳ", "ᏀϴϴᎠ ᎬᏙᎬΝᏆΝᏀ", "G꙲    o꙲    o꙲    d꙲     e꙲    v꙲    e꙲    n꙲    i꙲    n꙲    g꙲  ", " G⃫  o⃫  o⃫  d⃫   e⃫  v⃫  e⃫  n⃫  i⃫  n⃫  g⃫  ", "𝐺𝑜𝑜𝑑 𝑒𝑣𝑒𝑛𝑖𝑛𝑔", "𝘎𝘰𝘰𝘥 𝘦𝘷𝘦𝘯𝘪𝘯𝘨", "𝖦𝗈𝗈𝖽 𝖾𝗏𝖾𝗇𝗂𝗇𝗀", "𝗚𝗼𝗼𝗱 𝗲𝘃𝗲𝗻𝗶𝗻𝗴", "𝕲𝖔𝖔𝖉 𝖊𝖛𝖊𝖓𝖎𝖓𝖌", "𝒢ℴℴ𝒹 ℯ𝓋ℯ𝓃𝒾𝓃ℊ", "𝓖𝓸𝓸𝓭 𝓮𝓿𝓮𝓷𝓲𝓷𝓰"];

        var gn_len = gn_text. length;
        var gm_len = gm_text. length;
		var gf_len = gf_text. length;
        var ge_len = ge_text. length;

	    var gn = Math.floor(gn_len*Math.random());
	    var gm = Math.floor(gm_len*Math.random());
		var gf = Math.floor(gf_len*Math.random());
	    var ge = Math.floor(ge_len*Math.random());

		if (hrs < 12) wish = gm_text[gm];
        if (hrs >= 12 && hrs <= 17) wish = gf_text[gf];
        if (hrs >= 17 && hrs <= 19) wish = ge_text[ge];
        if (hrs >= 19 && hrs <= 24) wish = gn_text[gn];
		
	res.json({
		wish: wish,
		gm: gm_text[gm],
		gf: gf_text[gf],
		ge: ge_text[ge],
		gn: gn_text[gn]
	});
});


module.exports = router









